#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_compute_secgroup_v2.secgroup: Refreshing state... [id=47779555-2ce1-400c-ba68-d177683c7228]
openstack_networking_floatingip_v2.fip: Refreshing state... [id=1a2e1285-0a20-4582-aab9-27255607a862]
openstack_compute_instance_v2.dashboard: Refreshing state... [id=d34587f6-9f89-42ed-9bef-e01567da0fb0]
openstack_compute_floatingip_associate_v2.fip: Refreshing state... [id=147.213.76.217/d34587f6-9f89-42ed-9bef-e01567da0fb0/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_floatingip_associate_v2.fip must be replaced
-/+ resource "openstack_compute_floatingip_associate_v2" "fip" {
      ~ id          = "147.213.76.217/d34587f6-9f89-42ed-9bef-e01567da0fb0/" -> (known after apply)
      ~ instance_id = "d34587f6-9f89-42ed-9bef-e01567da0fb0" -> (known after apply) # forces replacement
      + region      = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # openstack_compute_instance_v2.dashboard must be replaced
-/+ resource "openstack_compute_instance_v2" "dashboard" {
      ~ access_ip_v4        = "192.168.10.37" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_name         = "m1.medium" -> (known after apply)
      ~ id                  = "d34587f6-9f89-42ed-9bef-e01567da0fb0" -> (known after apply)
      ~ image_name          = "Ubuntu-20.04-20211006" -> (known after apply)
        name                = "dashboard"
      + region              = (known after apply)
      - tags                = [] -> null
      ~ user_data           = "e5783927810fa151d550730fea0e615020d781e4" -> "d4c8505f3f0b43827f55116a540e6408c4cbcfad" # forces replacement
        # (6 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.10.37" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:69:0b:c1" -> (known after apply)
          ~ name           = "private-network" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*